index.html
<!DOCTYPE html>
<html prefix="
        og: http://ogp.me/ns# article: http://ogp.me/ns/article#
    " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Main activities | Harold Ollivier</title>
<link href="https://fonts.googleapis.com/css?family=Bitter:400,400i,700" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
<link href="assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="rss.xml">
<link rel="canonical" href="https://h-oll.github.io/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Harold Ollivier">
<meta property="og:site_name" content="Harold Ollivier">
<meta property="og:title" content="Main activities">
<meta property="og:url" content="https://h-oll.github.io/">
<meta property="og:description" content="Activities



Research


My research activity focuses on the interplay between application design and quantum computing architectures.



One application that we have been extensively developing is th">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-08-16T10:53:53+02:00">
</head>
<body>

	<a href="#page-content" class="sr-only sr-only-focusable">
		Skip to main content
	</a>

	

    <section id="header"><a href=".">
			<div class="logo">
					<div id="nologoimage">
						Harold Ollivier
					</div>
    		</div>
			</a>
    </section><section id="socialNav"><!-- Navigation Menu - on top on small screens, down the left on larger --><div class="navlinks">
			<a href=".">
				<div id="titleauth">
    					<!--Harold Ollivier<br /> by Harold Ollivier-->
				</div>
			</a>

            <!-- Navigation links (hidden by default) -->
			<div id="navmenuitems">
				            <a href="#" title="Home">
                <span class="menuitemtext">Home</span>
                <span class="menuitemicon"><i class="fa fa-home"></i></span>
            </a>
            <a href="hiring" title="Open Positions">
                <span class="menuitemtext">Open Positions</span>
                <span class="menuitemicon"><i class="fa fa-folder-open"></i></span>
            </a>
            <a href="about" title="About me">
                <span class="menuitemtext">About me</span>
                <span class="menuitemicon"><i class="fa fa-user"></i></span>
            </a>
            <a href="https://twitter.com/h_oll" title="Twitter">
                <span class="menuitemtext">Twitter</span>
                <span class="menuitemicon"><i class="fab fa-twitter"></i></span>
            </a>
            <a href="https://github.com/h-oll" title="Github">
                <span class="menuitemtext">Github</span>
                <span class="menuitemicon"><i class="fab fa-github"></i></span>
            </a>
    
    

			</div>

            <!-- "Hamburger menu" / "Bar icon" to toggle the navigation links -->
			<a href="javascript:void(0);" id="hamburger" class="icon" onclick="toggleNav()">
				<i class="fa fa-bars">
				</i>
			</a>
		</div>

	</section><section class="page-content"><div class="content" rel="main">
<article class="post-text storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header></header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org14b4082" class="outline-2">
<h2 id="org14b4082">Activities</h2>
<div class="outline-text-2" id="text-org14b4082">
</div>
<div id="outline-container-org3aec977" class="outline-3">
<h3 id="org3aec977">Research</h3>
<div class="outline-text-3" id="text-org3aec977">
<p>
My research activity focuses on the interplay between application design and quantum computing architectures.
</p>

<p>
One application that we have been extensively developing is the delegation of quantum computations to third-party providers while maintaining security – ie. privacy of the data and algorithm used, as well as integrity of the computation itself. Several approaches have been designed over the years for tackling this question. The one the team is working on is based on trapification of measurement based quantum computation. It is lightweight in the overhead at the client side – only single qubit operations are required – while most of the burden is taken care of by the server. To enable this approach it is nonetheless needed to have quantum communication between the client and the server.
</p>

<p>
Our latest protocol<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> has enabled a drastic lowering of the requirements at the server's side to the point where it is now feasible to have small proof of concepts of verified quantum computations using existing devices. The constraints imposed by the noisy devices available have been taken care of by using classical amplification for the trap's detection sensitivity. We removed the burden of having a specific fault-tolerant encoding for this crucial part of the protocol. This allows a constant level of noise per run and removes all space overhead of the protocol – converting it instead into a polynomial time overhead.
</p>

<p>
One of our future goals is to continue provide generic methods for reducing the overhead of these protocols and to enhance their usefulness for NISQ machines.
</p>

<p>
A connected research line that we follow is the use of measurement based quantum computating to overcome the difficulty of implementing protocols for secure multi-party quantum computations. We introduced a generic protocol<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> with low overhead for the clients and the server, while allowing all but one party to be malicious while retaining security. Turning such protocol into experimentally implementable is one of our next goals.
</p>

<p>
Other topics that we are currently investigating with a similar approach – integration of physical constraints into the design of new protocols and algorithms – are
</p>
<ul class="org-ul">
<li>quantum machine learning</li>
<li>benchmarking and noise characterization</li>
</ul>
<p>
I've been also contributing to the understanding of the emergence of classical objective properties out of quantum theory in various settings, such as many-body physics<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup></p>
</div>
</div>

<div id="outline-container-org42c2c24" class="outline-3">
<h3 id="org42c2c24">QuantumTech@INRIA</h3>
<div class="outline-text-3" id="text-org42c2c24">
<p>
I head the QuantumTech Program launched by INRIA in 2021 to materialize its quantum expertise started more than 20 years ago on decoherence and quantum error correction. One of the objectives for this program is to accompany the deployment of the National Strategy for Quantum Technologies through the participation of INRIA teams to several research and development projects. The program provides coordination for the research teams at the national as well as international level. 
</p>

<p>
Several teams are naturally part of QuantumTech@INRIA as they are dedicated to quantum information such as <a href="https://www.inria.fr/en/cosmiq">COSMIQ</a>, <a href="https://www.inria.fr/en/mocqua">MOCQUA</a>, <a href="https://www.inria.fr/en/qinfo">QInfo</a>, <a href="https://www.inria.fr/en/quacs">QUACS</a>, <a href="https://www.inria.fr/en/quantic">QUANTIC</a>. Expertise is also being built-up in collaboration with several classical INRIA teams that can benefit from quantum algorithms.
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef">
<sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup><div class="footpara" role="doc-footnote"><p class="footpara">
"Securing Quantum Computations in the NISQ Era", Elham Kashefi, Dominik Leichtle, Luka Music, Harold Ollivier, PRX Quantum 2, 040302 (2021) <a href="https://journals.aps.org/prxquantum/abstract/10.1103/PRXQuantum.2.040302">https://journals.aps.org/prxquantum/abstract/10.1103/PRXQuantum.2.040302</a>
</p></div>
</div>

<div class="footdef">
<sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup><div class="footpara" role="doc-footnote"><p class="footpara">
"Delegating Multi-Party Quantum Computations vs. Dishonest Majority in Two Quantum Rounds", Théodoros Kapourniotis, Elham Kashefi, Luka Music, Harold Ollivier <a href="http://www.arxiv.org/abs/2102.12949">http://www.arxiv.org/abs/2102.12949</a>
</p></div>
</div>

<div class="footdef">
<sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup><div class="footpara" role="doc-footnote"><p class="footpara">
"Emergence of Objectivity for Quantum Many-Body Systems", Harold Ollivier Entropy, 24(2), 277 (2022) <a href="https://www.mdpi.com/1099-4300/24/2/277">https://www.mdpi.com/1099-4300/24/2/277</a>
</p></div>
</div>


</div>
</div>
    </div>
    
</article><footer id="footer"><p>Contents © 2022         <a href="mailto:harold.ollivier@inria.fr">Harold Ollivier</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
	</section><script src="assets/js/all-nocdn.js"></script><!-- fancy dates --><script>

    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");

	</script><!-- end fancy dates --><script>

    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});

	</script><script src="assets/js/ToggleNav.js">
	</script><!-- Global site tag (gtag.js) - Google Analytics --><script async src="https://www.googletagmanager.com/gtag/js?id=G-RGE92PZF3Q"></script><script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'G-RGE92PZF3Q');
</script>
</body>
</html>
